{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "dropout": 0.0, "units": 6, "recurrent_dropout": 1.0, "dtype": "float32", "return_sequences": true, "activity_regularizer": null, "use_bias": true, "stateful": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "batch_input_shape": [1, 1, 1], "bias_constraint": null, "return_state": false, "recurrent_activation": "tanh", "unit_forget_bias": true, "implementation": 1}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_2", "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "dropout": 0.0, "units": 6, "recurrent_dropout": 1.0, "unroll": false, "return_sequences": false, "activity_regularizer": null, "stateful": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "return_state": false, "recurrent_activation": "tanh", "unit_forget_bias": true, "implementation": 1}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "tanh", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 1, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true}}]}