{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "go_backwards": false, "dropout": 0.0, "implementation": 1, "bias_regularizer": null, "activity_regularizer": null, "name": "lstm_1", "recurrent_activation": "tanh", "return_state": false, "use_bias": true, "units": 14, "unit_forget_bias": true, "stateful": true, "recurrent_dropout": 1.0, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "batch_input_shape": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "recurrent_activation": "tanh", "bias_constraint": null, "go_backwards": false, "dropout": 0.0, "implementation": 1, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "return_state": false, "use_bias": true, "units": 14, "unit_forget_bias": true, "stateful": true, "recurrent_dropout": 1.0, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "recurrent_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 1, "trainable": true}}], "backend": "tensorflow"}