{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"units": 6, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "go_backwards": false, "unit_forget_bias": true, "return_sequences": true, "name": "lstm_1", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_activation": "tanh", "recurrent_dropout": 1.0, "trainable": true, "bias_regularizer": null, "return_state": false, "implementation": 1, "recurrent_constraint": null, "batch_input_shape": [1, 1, 1], "stateful": true}}, {"class_name": "LSTM", "config": {"units": 6, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dropout": 0.0, "recurrent_regularizer": null, "go_backwards": false, "bias_constraint": null, "name": "lstm_2", "unit_forget_bias": true, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_activation": "tanh", "recurrent_dropout": 1.0, "trainable": true, "bias_regularizer": null, "return_state": false, "implementation": 1, "recurrent_constraint": null, "stateful": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh", "trainable": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}