{"config": [{"config": {"trainable": true, "name": "lstm_1", "dtype": "float32", "implementation": 1, "kernel_constraint": null, "return_sequences": true, "batch_input_shape": [1, 1, 1], "recurrent_dropout": 1.0, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "go_backwards": false, "dropout": 0.0, "units": 8, "kernel_regularizer": null, "recurrent_activation": "tanh", "recurrent_regularizer": null, "return_state": false, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": true, "unroll": false, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "dropout": 0.0, "implementation": 1, "kernel_constraint": null, "return_sequences": false, "unroll": false, "recurrent_dropout": 1.0, "activity_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "go_backwards": false, "trainable": true, "units": 8, "kernel_regularizer": null, "recurrent_activation": "tanh", "recurrent_regularizer": null, "return_state": false, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}