{"config": [{"config": {"recurrent_activation": "tanh", "go_backwards": false, "unroll": false, "bias_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activation": "tanh", "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 10, "dtype": "float32", "implementation": 1, "activity_regularizer": null, "name": "lstm_1", "batch_input_shape": [1, 1, 1], "recurrent_constraint": null, "kernel_constraint": null, "use_bias": true, "stateful": true, "dropout": 0.0, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 1.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "tanh", "stateful": true, "go_backwards": false, "unroll": false, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "return_state": false, "return_sequences": false, "bias_regularizer": null, "units": 10, "activity_regularizer": null, "name": "lstm_2", "recurrent_constraint": null, "kernel_constraint": null, "use_bias": true, "implementation": 1, "dropout": 0.0, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 1.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}