{"backend": "tensorflow", "config": [{"config": {"return_sequences": true, "kernel_constraint": null, "activation": "tanh", "kernel_regularizer": null, "units": 12, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_constraint": null, "go_backwards": false, "batch_input_shape": [1, 1, 1], "stateful": true, "use_bias": true, "recurrent_dropout": 1.0, "bias_regularizer": null, "trainable": true, "return_state": false, "activity_regularizer": null, "name": "lstm_1", "dropout": 0.0, "dtype": "float32", "recurrent_activation": "tanh", "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 1, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"return_sequences": false, "kernel_constraint": null, "activation": "tanh", "kernel_regularizer": null, "units": 12, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "bias_constraint": null, "go_backwards": false, "trainable": true, "stateful": true, "use_bias": true, "recurrent_dropout": 1.0, "bias_regularizer": null, "return_state": false, "activity_regularizer": null, "name": "lstm_2", "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "tanh", "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 1, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 1, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "tanh", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}