{"config": [{"config": {"recurrent_regularizer": null, "return_state": false, "return_sequences": true, "use_bias": true, "batch_input_shape": [1, 1, 1], "dropout": 0.0, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "name": "lstm_1", "kernel_regularizer": null, "activation": "tanh", "recurrent_dropout": 1.0, "unroll": false, "stateful": true, "units": 8, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "tanh", "dtype": "float32", "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "return_state": false, "return_sequences": false, "use_bias": true, "dropout": 0.0, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "name": "lstm_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "recurrent_dropout": 1.0, "unroll": false, "stateful": true, "units": 8, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "tanh", "recurrent_constraint": null, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "trainable": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}