{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "use_bias": true, "unroll": false, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_activation": "tanh", "bias_constraint": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 1.0, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dtype": "float32", "bias_regularizer": null, "implementation": 1, "activity_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "batch_input_shape": [1, 1, 1], "stateful": true, "return_state": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 10}}, {"class_name": "LSTM", "config": {"activation": "tanh", "use_bias": true, "unroll": false, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "recurrent_activation": "tanh", "bias_constraint": null, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 1.0, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "implementation": 1, "activity_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "stateful": true, "return_state": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 10}}, {"class_name": "Dense", "config": {"activation": "tanh", "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "units": 1}}]}