{"config": [{"config": {"stateful": true, "dtype": "float32", "recurrent_regularizer": null, "use_bias": true, "activation": "tanh", "unroll": false, "bias_regularizer": null, "batch_input_shape": [1, 1, 1], "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "bias_constraint": null, "return_sequences": true, "return_state": false, "kernel_constraint": null, "recurrent_activation": "tanh", "units": 12, "name": "lstm_1", "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 1.0, "dropout": 0.0, "kernel_regularizer": null, "trainable": true}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "tanh", "unroll": false, "recurrent_regularizer": null, "use_bias": true, "activation": "tanh", "stateful": true, "bias_regularizer": null, "units": 12, "unit_forget_bias": true, "bias_constraint": null, "return_sequences": false, "return_state": false, "kernel_constraint": null, "trainable": true, "go_backwards": false, "name": "lstm_2", "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 1.0, "dropout": 0.0, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "activity_regularizer": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}