{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_1", "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "implementation": 1, "recurrent_regularizer": null, "dtype": "float32", "recurrent_activation": "tanh", "kernel_constraint": null, "return_state": false, "batch_input_shape": [1, 1, 1], "units": 14, "stateful": true, "unroll": false, "return_sequences": true, "recurrent_dropout": 1.0, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "go_backwards": false, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "tanh", "kernel_constraint": null, "return_state": false, "units": 14, "stateful": true, "unroll": false, "return_sequences": false, "recurrent_dropout": 1.0, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh"}}]}