{"config": [{"config": {"use_bias": true, "activation": "tanh", "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "name": "lstm_1", "recurrent_dropout": 1.0, "trainable": true, "bias_constraint": null, "stateful": true, "recurrent_activation": "tanh", "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "return_sequences": true, "unroll": false, "batch_input_shape": [1, 1, 1]}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "name": "lstm_2", "recurrent_dropout": 1.0, "trainable": true, "bias_constraint": null, "stateful": true, "recurrent_activation": "tanh", "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "units": 8, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "bias_regularizer": null, "go_backwards": false, "return_sequences": false, "unroll": false}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}