{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "recurrent_dropout": 1.0, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 8, "activation": "tanh", "recurrent_regularizer": null, "implementation": 1, "bias_constraint": null, "kernel_constraint": null, "unroll": false, "batch_input_shape": [1, 1, 1], "stateful": true, "dropout": 0.0, "unit_forget_bias": true, "go_backwards": false, "return_state": false, "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "return_state": false, "recurrent_dropout": 1.0, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 8, "activation": "tanh", "recurrent_regularizer": null, "implementation": 1, "bias_constraint": null, "kernel_constraint": null, "unroll": false, "stateful": true, "dropout": 0.0, "unit_forget_bias": true, "go_backwards": false, "use_bias": true, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"units": 1, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.2.2"}