{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": true, "implementation": 1, "name": "lstm_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "batch_input_shape": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_activation": "tanh", "bias_constraint": null, "units": 10, "go_backwards": false, "return_state": false, "use_bias": true, "recurrent_constraint": null, "trainable": true, "recurrent_dropout": 1.0, "return_sequences": true, "dtype": "float32", "activation": "tanh", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"stateful": true, "implementation": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "tanh", "dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "unroll": false, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "units": 10, "go_backwards": false, "return_state": false, "recurrent_activation": "tanh", "use_bias": true, "bias_constraint": null, "trainable": true, "recurrent_dropout": 1.0, "return_sequences": false, "name": "lstm_2", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "tanh", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 1, "bias_constraint": null}}], "keras_version": "2.2.2"}