{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "trainable": true, "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_activation": "tanh", "unit_forget_bias": true, "implementation": 1, "dtype": "float32", "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "return_sequences": true, "name": "lstm_1", "recurrent_dropout": 1.0, "bias_constraint": null, "batch_input_shape": [1, 1, 1], "return_state": false, "dropout": 0.0, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 12, "stateful": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "unroll": false, "trainable": true, "kernel_constraint": null, "recurrent_regularizer": null, "use_bias": true, "recurrent_activation": "tanh", "implementation": 1, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "return_sequences": false, "name": "lstm_2", "recurrent_dropout": 1.0, "bias_constraint": null, "return_state": false, "dropout": 0.0, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 12, "stateful": true, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1"}}], "keras_version": "2.2.2", "backend": "tensorflow"}