{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [1, 1, 1], "recurrent_activation": "tanh", "go_backwards": false, "use_bias": true, "trainable": true, "recurrent_regularizer": null, "name": "lstm_1", "return_sequences": true, "recurrent_constraint": null, "recurrent_dropout": 1.0, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "dropout": 0.0, "dtype": "float32", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_constraint": null, "return_state": false, "bias_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "stateful": true, "implementation": 1, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "tanh", "go_backwards": false, "use_bias": true, "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "return_sequences": false, "return_state": false, "recurrent_dropout": 1.0, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "dropout": 0.0, "stateful": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "name": "lstm_2", "implementation": 1, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}], "backend": "tensorflow"}