{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"return_state": false, "activity_regularizer": null, "stateful": true, "unit_forget_bias": true, "recurrent_regularizer": null, "bias_regularizer": null, "go_backwards": false, "name": "lstm_1", "dtype": "float32", "batch_input_shape": [1, 1, 1], "kernel_regularizer": null, "implementation": 1, "recurrent_constraint": null, "dropout": 0.0, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "unroll": false, "recurrent_activation": "tanh", "bias_constraint": null, "recurrent_dropout": 1.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_sequences": true, "use_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true}}, {"class_name": "LSTM", "config": {"return_state": false, "recurrent_regularizer": null, "stateful": true, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null, "go_backwards": false, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "implementation": 1, "recurrent_constraint": null, "dropout": 0.0, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "unroll": false, "recurrent_activation": "tanh", "bias_constraint": null, "recurrent_dropout": 1.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_sequences": false, "use_bias": true, "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "trainable": true}}]}