{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"implementation": 1, "dtype": "float32", "bias_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "activation": "tanh", "units": 8, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "stateful": true, "return_sequences": true, "batch_input_shape": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_dropout": 1.0, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "unroll": false, "name": "lstm_1", "recurrent_regularizer": null, "return_state": false, "unit_forget_bias": true, "recurrent_activation": "tanh"}}, {"class_name": "LSTM", "config": {"implementation": 1, "dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "activation": "tanh", "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": true, "return_sequences": false, "recurrent_dropout": 1.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "unroll": false, "recurrent_regularizer": null, "return_state": false, "unit_forget_bias": true, "recurrent_activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null}}], "backend": "tensorflow"}