{"config": [{"config": {"dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "stateful": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "unroll": false, "use_bias": true, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "return_sequences": true, "activity_regularizer": null, "batch_input_shape": [1, 1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "recurrent_activation": "tanh", "name": "lstm_1", "dtype": "float32", "recurrent_dropout": 1.0, "units": 6, "bias_constraint": null, "return_state": false}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "recurrent_constraint": null, "stateful": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "unroll": false, "use_bias": true, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "name": "lstm_2", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "recurrent_activation": "tanh", "return_sequences": false, "recurrent_dropout": 1.0, "units": 6, "bias_constraint": null, "return_state": false}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}