{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "use_bias": true, "recurrent_dropout": 1.0, "bias_regularizer": null, "stateful": true, "kernel_regularizer": null, "batch_input_shape": [1, 1, 1], "recurrent_activation": "tanh", "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "return_sequences": true, "dtype": "float32", "unit_forget_bias": true, "units": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "implementation": 1}}, {"class_name": "LSTM", "config": {"trainable": true, "name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "use_bias": true, "recurrent_dropout": 1.0, "unit_forget_bias": true, "stateful": true, "kernel_regularizer": null, "recurrent_activation": "tanh", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "return_sequences": false, "activation": "tanh", "bias_regularizer": null, "units": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}]}