{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 16, "use_bias": true, "recurrent_activation": "tanh", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "dtype": "float32", "activation": "tanh", "batch_input_shape": [1, 1, 1], "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": true, "bias_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_state": false, "recurrent_dropout": 1.0, "stateful": true, "unroll": false}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "units": 16, "use_bias": true, "recurrent_activation": "tanh", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "unroll": false, "activation": "tanh", "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "bias_regularizer": null, "name": "lstm_2", "unit_forget_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_constraint": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_state": false, "recurrent_dropout": 1.0, "stateful": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 1, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "tanh", "trainable": true, "kernel_constraint": null}}]}