{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 8, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 1.0, "trainable": true, "kernel_regularizer": null, "implementation": 1, "dtype": "float32", "kernel_constraint": null, "recurrent_regularizer": null, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "unroll": false, "stateful": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "go_backwards": false, "recurrent_activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "return_sequences": true, "bias_constraint": null, "recurrent_constraint": null, "return_state": false, "name": "lstm_1", "batch_input_shape": [1, 1, 1], "unit_forget_bias": true, "dropout": 0.0}}, {"class_name": "LSTM", "config": {"units": 8, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 1.0, "trainable": true, "kernel_regularizer": null, "implementation": 1, "kernel_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "unroll": false, "stateful": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "go_backwards": false, "recurrent_activation": "tanh", "activation": "tanh", "use_bias": true, "return_sequences": false, "bias_constraint": null, "recurrent_constraint": null, "return_state": false, "name": "lstm_2", "unit_forget_bias": true, "dropout": 0.0}}, {"class_name": "Dense", "config": {"units": 1, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}], "backend": "tensorflow", "keras_version": "2.2.2"}