{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "use_bias": true, "return_state": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "batch_input_shape": [1, 1, 1], "bias_constraint": null, "bias_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "recurrent_dropout": 1.0, "stateful": true, "implementation": 1, "trainable": true, "kernel_constraint": null, "dtype": "float32", "units": 14, "return_sequences": true, "go_backwards": false, "recurrent_activation": "tanh", "recurrent_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "use_bias": true, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activation": "tanh", "recurrent_dropout": 1.0, "stateful": true, "implementation": 1, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "units": 14, "return_sequences": false, "go_backwards": false, "recurrent_activation": "tanh", "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "tanh", "kernel_regularizer": null, "units": 1, "activity_regularizer": null}}]}