{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "stateful": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "dtype": "float32", "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": true, "bias_constraint": null, "recurrent_dropout": 1.0, "activity_regularizer": null, "recurrent_constraint": null, "return_state": false, "unroll": false, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "unit_forget_bias": true, "use_bias": true, "name": "lstm_1", "batch_input_shape": [1, 1, 1], "go_backwards": false, "recurrent_activation": "tanh"}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "units": 6, "stateful": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_2", "recurrent_regularizer": null, "dropout": 0.0, "return_sequences": false, "bias_constraint": null, "recurrent_constraint": null, "return_state": false, "unroll": false, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "bias_regularizer": null, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 1.0, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "tanh"}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}