{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "unit_forget_bias": true, "batch_input_shape": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "recurrent_activation": "tanh", "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 1.0, "go_backwards": false, "dtype": "float32", "units": 6, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "unroll": false, "return_state": false, "name": "lstm_1", "kernel_constraint": null, "stateful": true, "use_bias": true, "bias_constraint": null, "dropout": 0.0, "implementation": 1}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "recurrent_activation": "tanh", "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 1.0, "go_backwards": false, "implementation": 1, "units": 6, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "unroll": false, "return_state": false, "name": "lstm_2", "stateful": true, "use_bias": true, "bias_constraint": null, "dropout": 0.0, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "trainable": true, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "use_bias": true}}], "keras_version": "2.2.2"}