{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"stateful": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "unroll": false, "recurrent_dropout": 1.0, "dropout": 0.0, "return_state": false, "units": 6, "kernel_constraint": null, "batch_input_shape": [1, 1, 1], "bias_regularizer": null, "use_bias": true, "name": "lstm_1", "return_sequences": true, "activity_regularizer": null, "implementation": 1, "recurrent_regularizer": null, "kernel_regularizer": null, "unit_forget_bias": true, "trainable": true, "dtype": "float32", "bias_constraint": null, "go_backwards": false, "recurrent_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "LSTM", "config": {"stateful": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "unroll": false, "recurrent_dropout": 1.0, "dropout": 0.0, "return_state": false, "units": 6, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "lstm_2", "return_sequences": false, "activity_regularizer": null, "implementation": 1, "recurrent_regularizer": null, "kernel_regularizer": null, "unit_forget_bias": true, "trainable": true, "bias_constraint": null, "go_backwards": false, "recurrent_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activation": "tanh"}}]}