{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "batch_input_shape": [1, 1, 1], "units": 10, "recurrent_constraint": null, "return_state": false, "recurrent_dropout": 1.0, "go_backwards": false, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "recurrent_regularizer": null, "trainable": true, "stateful": true, "name": "lstm_1", "bias_regularizer": null, "recurrent_activation": "tanh", "dropout": 0.0, "implementation": 1, "kernel_constraint": null, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "return_state": false, "units": 10, "recurrent_constraint": null, "recurrent_dropout": 1.0, "go_backwards": false, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_regularizer": null, "trainable": true, "stateful": true, "name": "lstm_2", "bias_regularizer": null, "recurrent_activation": "tanh", "dropout": 0.0, "implementation": 1, "kernel_constraint": null, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "tanh", "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "trainable": true, "kernel_regularizer": null}}]}