{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_constraint": null, "return_state": false, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "batch_input_shape": [1, 1, 1], "unit_forget_bias": true, "recurrent_activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "name": "lstm_1", "recurrent_dropout": 1.0, "activation": "tanh", "trainable": true, "return_sequences": true, "units": 8, "recurrent_constraint": null, "stateful": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "return_state": false, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "go_backwards": false, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "name": "lstm_2", "recurrent_dropout": 1.0, "activation": "tanh", "trainable": true, "return_sequences": false, "units": 8, "recurrent_constraint": null, "stateful": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}], "backend": "tensorflow"}