{"config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "stateful": true, "bias_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "return_sequences": true, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "implementation": 1, "unit_forget_bias": true, "recurrent_activation": "tanh", "trainable": true, "dtype": "float32", "bias_regularizer": null, "units": 10, "activation": "tanh", "kernel_constraint": null, "recurrent_dropout": 1.0, "go_backwards": false, "batch_input_shape": [1, 1, 1], "use_bias": true, "return_state": false}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "return_sequences": false, "dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "stateful": true, "kernel_regularizer": null, "implementation": 1, "unit_forget_bias": true, "recurrent_dropout": 1.0, "trainable": true, "bias_regularizer": null, "units": 10, "activation": "tanh", "kernel_constraint": null, "recurrent_activation": "tanh", "go_backwards": false, "use_bias": true, "return_state": false}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 1, "kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null, "use_bias": true}}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}