{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_constraint": null, "stateful": true, "recurrent_regularizer": null, "units": 10, "bias_regularizer": null, "unroll": false, "activation": "tanh", "batch_input_shape": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "recurrent_dropout": 1.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "implementation": 1, "bias_constraint": null, "recurrent_activation": "tanh", "go_backwards": false, "dtype": "float32", "unit_forget_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "name": "lstm_1", "kernel_constraint": null, "return_sequences": true, "trainable": true}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_constraint": null, "stateful": true, "recurrent_regularizer": null, "units": 10, "bias_regularizer": null, "unroll": false, "activation": "tanh", "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "recurrent_dropout": 1.0, "use_bias": true, "implementation": 1, "bias_constraint": null, "trainable": true, "recurrent_activation": "tanh", "unit_forget_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "name": "lstm_2", "kernel_constraint": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "trainable": true}}]}