{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "dropout": 0.0, "unroll": false, "return_state": false, "name": "lstm_1", "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "bias_regularizer": null, "units": 10, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_dropout": 1.0, "recurrent_activation": "tanh", "recurrent_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "batch_input_shape": [1, 1, 1], "stateful": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "unit_forget_bias": true, "implementation": 1, "activity_regularizer": null, "return_sequences": true}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "unroll": false, "use_bias": true, "name": "lstm_2", "kernel_constraint": null, "go_backwards": false, "bias_regularizer": null, "units": 10, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_dropout": 1.0, "recurrent_activation": "tanh", "recurrent_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "stateful": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_state": false, "activation": "tanh", "implementation": 1, "activity_regularizer": null, "return_sequences": false}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activation": "tanh", "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null}}]}