{"config": [{"config": {"dtype": "float32", "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [1, 1, 1], "units": 14, "trainable": true, "activity_regularizer": null, "dropout": 0.0, "recurrent_activation": "tanh", "recurrent_dropout": 1.0, "implementation": 1, "name": "lstm_1", "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "go_backwards": false, "return_state": false, "stateful": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 14, "trainable": true, "activity_regularizer": null, "dropout": 0.0, "recurrent_activation": "tanh", "recurrent_dropout": 1.0, "implementation": 1, "go_backwards": false, "name": "lstm_2", "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "stateful": true, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "units": 1, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "tanh", "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}