{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [1, 1, 1], "stateful": true, "recurrent_constraint": null, "dropout": 0.0, "recurrent_activation": "tanh", "unroll": false, "go_backwards": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 1.0, "recurrent_regularizer": null, "trainable": true, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "unit_forget_bias": true, "units": 8, "use_bias": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "return_sequences": true, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"stateful": true, "recurrent_constraint": null, "dropout": 0.0, "recurrent_activation": "tanh", "unroll": false, "go_backwards": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "trainable": true, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "unit_forget_bias": true, "bias_constraint": null, "recurrent_dropout": 1.0, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "bias_regularizer": null, "units": 8, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "return_sequences": false, "activation": "tanh"}}, {"class_name": "Dense", "config": {"units": 1, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh"}}], "class_name": "Sequential"}