{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "units": 6, "activation": "tanh", "recurrent_activation": "tanh", "stateful": true, "unit_forget_bias": true, "dropout": 0.0, "return_state": false, "go_backwards": false, "use_bias": true, "unroll": false, "return_sequences": true, "activity_regularizer": null, "batch_input_shape": [1, 1, 1], "recurrent_regularizer": null, "recurrent_dropout": 1.0, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "implementation": 1, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"units": 6, "activation": "tanh", "recurrent_activation": "tanh", "stateful": true, "unit_forget_bias": true, "dropout": 0.0, "return_state": false, "go_backwards": false, "use_bias": true, "unroll": false, "return_sequences": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_regularizer": null, "recurrent_dropout": 1.0, "kernel_regularizer": null, "recurrent_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "implementation": 1, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_2", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 1, "use_bias": true, "activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null}}]}