{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 1.0, "dropout": 0.0, "activation": "tanh", "units": 6, "return_state": false, "batch_input_shape": [1, 1, 1], "bias_constraint": null, "dtype": "float32", "unroll": false, "trainable": true, "use_bias": true, "stateful": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "go_backwards": false, "recurrent_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "implementation": 1, "return_sequences": true, "recurrent_activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 1.0, "dropout": 0.0, "activation": "tanh", "units": 6, "return_state": false, "implementation": 1, "bias_constraint": null, "unroll": false, "trainable": true, "use_bias": true, "stateful": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "go_backwards": false, "recurrent_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "return_sequences": false, "recurrent_activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activity_regularizer": null, "activation": "tanh", "bias_regularizer": null, "units": 1, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1", "kernel_regularizer": null}}]}