{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "implementation": 1, "activation": "tanh", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [1, 1, 1], "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "recurrent_regularizer": null, "return_state": false, "kernel_regularizer": null, "dropout": 0.0, "recurrent_activation": "tanh", "return_sequences": true, "unroll": false, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "lstm_1", "stateful": true, "recurrent_dropout": 1.0, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "trainable": true, "units": 6}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "implementation": 1, "activation": "tanh", "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dropout": 0.0, "recurrent_activation": "tanh", "return_sequences": false, "unroll": false, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "lstm_2", "stateful": true, "recurrent_dropout": 1.0, "recurrent_constraint": null, "return_state": false, "go_backwards": false, "trainable": true, "units": 6}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "units": 1}}]}