{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 1, "stateful": true, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_dropout": 1.0, "batch_input_shape": [1, 1, 1], "kernel_regularizer": null, "recurrent_regularizer": null, "units": 12, "activation": "tanh", "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "unroll": false, "recurrent_activation": "tanh", "name": "lstm_1", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"go_backwards": false, "unit_forget_bias": true, "recurrent_constraint": null, "implementation": 1, "stateful": true, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_dropout": 1.0, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 12, "activation": "tanh", "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "unroll": false, "recurrent_activation": "tanh", "name": "lstm_2", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "activation": "tanh", "name": "dense_1", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}]}