{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 16, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "return_sequences": true, "dtype": "float32", "return_state": false, "recurrent_dropout": 1.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "implementation": 1, "trainable": true, "unroll": false, "batch_input_shape": [1, 1, 1], "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "stateful": true, "recurrent_activation": "tanh", "unit_forget_bias": true, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_1", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "go_backwards": false}}, {"class_name": "LSTM", "config": {"units": 16, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "return_sequences": false, "return_state": false, "recurrent_dropout": 1.0, "bias_constraint": null, "kernel_constraint": null, "implementation": 1, "trainable": true, "recurrent_regularizer": null, "dropout": 0.0, "activation": "tanh", "use_bias": true, "stateful": true, "recurrent_activation": "tanh", "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "lstm_2", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "go_backwards": false, "unroll": false}}, {"class_name": "Dense", "config": {"units": 1, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1"}}]}