{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"dtype": "float32", "kernel_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dropout": 0.0, "batch_input_shape": [1, 1, 1], "stateful": true, "return_state": false, "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "recurrent_dropout": 1.0, "go_backwards": false, "bias_regularizer": null, "implementation": 1, "recurrent_activation": "tanh", "units": 10, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "return_sequences": true, "unit_forget_bias": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dropout": 0.0, "stateful": true, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_2", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "recurrent_dropout": 1.0, "go_backwards": false, "bias_regularizer": null, "implementation": 1, "recurrent_activation": "tanh", "units": 10, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "return_sequences": false, "unit_forget_bias": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 1, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}