{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "name": "lstm_1", "batch_input_shape": [1, 1, 1], "activity_regularizer": null, "recurrent_dropout": 1.0, "unroll": false, "stateful": true, "recurrent_activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "go_backwards": false, "units": 10, "implementation": 1, "bias_regularizer": null, "return_sequences": true, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "activity_regularizer": null, "recurrent_dropout": 1.0, "unroll": false, "stateful": true, "recurrent_activation": "tanh", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "recurrent_regularizer": null, "units": 10, "implementation": 1, "bias_regularizer": null, "return_sequences": false, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "go_backwards": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 1, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "trainable": true}}]}